
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 0 to add, 1 to change, 3 to destroy.</code></pre>

* Update
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Delete
  * azurerm_key_vault_secret.civil_db_host__v15_secret
  * azurerm_key_vault_secret.civil_db_password__v15_secret
  * azurerm_key_vault_secret.civil_db_username__v15_secret


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_user_assigned_identity.app_mi will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "app_mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "civil-aat-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-aat-rg"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)
    }

  # azurerm_key_vault_secret.civil_db_host__v15_secret will be destroyed
  # (because azurerm_key_vault_secret.civil_db_host__v15_secret is not in configuration)
  - resource "azurerm_key_vault_secret" "civil_db_host__v15_secret" {
      - content_type            = "secret" -> null
      - id                      = "https://civil-aat.vault.azure.net/secrets/cmc-db-host-v15/9d555b96c91c4351b1e6e2d7b425a0c4" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat" -> null
      - name                    = "cmc-db-host-v15" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat/secrets/cmc-db-host-v15/versions/9d555b96c91c4351b1e6e2d7b425a0c4" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat/secrets/cmc-db-host-v15" -> null
      - tags                    = {
          - "application"         = "civil"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/civil-service.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#civil_contact"
          - "environment"         = "staging"
          - "managedBy"           = "Civil"
          - "source"              = "Vault cmc-aat"
        } -> null
      - value                   = (sensitive value) -> null
      - version                 = "9d555b96c91c4351b1e6e2d7b425a0c4" -> null
      - versionless_id          = "https://civil-aat.vault.azure.net/secrets/cmc-db-host-v15" -> null
    }

  # azurerm_key_vault_secret.civil_db_password__v15_secret will be destroyed
  # (because azurerm_key_vault_secret.civil_db_password__v15_secret is not in configuration)
  - resource "azurerm_key_vault_secret" "civil_db_password__v15_secret" {
      - content_type            = "secret" -> null
      - id                      = "https://civil-aat.vault.azure.net/secrets/cmc-db-password-v15/30367cae1cc048f99cdb16a4259eb9f8" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat" -> null
      - name                    = "cmc-db-password-v15" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat/secrets/cmc-db-password-v15/versions/30367cae1cc048f99cdb16a4259eb9f8" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat/secrets/cmc-db-password-v15" -> null
      - tags                    = {
          - "application"         = "civil"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/civil-service.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#civil_contact"
          - "environment"         = "staging"
          - "managedBy"           = "Civil"
          - "source"              = "Vault cmc-aat"
        } -> null
      - value                   = (sensitive value) -> null
      - version                 = "30367cae1cc048f99cdb16a4259eb9f8" -> null
      - versionless_id          = "https://civil-aat.vault.azure.net/secrets/cmc-db-password-v15" -> null
    }

  # azurerm_key_vault_secret.civil_db_username__v15_secret will be destroyed
  # (because azurerm_key_vault_secret.civil_db_username__v15_secret is not in configuration)
  - resource "azurerm_key_vault_secret" "civil_db_username__v15_secret" {
      - content_type            = "secret" -> null
      - id                      = "https://civil-aat.vault.azure.net/secrets/cmc-db-username-v15/a0a62840d5d74e79af99eb3529606b18" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat" -> null
      - name                    = "cmc-db-username-v15" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat/secrets/cmc-db-username-v15/versions/a0a62840d5d74e79af99eb3529606b18" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat/secrets/cmc-db-username-v15" -> null
      - tags                    = {
          - "application"         = "civil"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/civil-service.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#civil_contact"
          - "environment"         = "staging"
          - "managedBy"           = "Civil"
          - "source"              = "Vault cmc-aat"
        } -> null
      - value                   = (sensitive value) -> null
      - version                 = "a0a62840d5d74e79af99eb3529606b18" -> null
      - versionless_id          = "https://civil-aat.vault.azure.net/secrets/cmc-db-username-v15" -> null
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat|civil-aat"
        name                           = "civil-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":3609,"Program":"tfcmt","SHA1":"","Vars":{}} -->